In [75]:
#import pandas library
import pandas as pd

In [4]:
#read a csv_file
df = pd.read_csv(r'C:\Users\Keerthana V\Documents\Keerthana-D\github\3_Key operations on Dataframes\weather_data.csv')

In [7]:
#read a excel file
# df = pd.read_excel(r'C:\Users\Keerthana V\Documents\Keerthana-D\github\3_Key operations on Dataframes\weather_data.xslx')

## GroupBy

In [61]:
df = pd.read_csv(r'C:\Users\Keerthana V\Documents\Keerthana-D\github\3_Key operations on Dataframes\weather_data_cities.csv')

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
dtypes: int64(2), object(3)
memory usage: 608.0+ bytes

In [63]:
df.head(5)

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [64]:
df.tail()

         day    city  temperature  windspeed   event
7   1/4/2017  mumbai           92          5    Rain
8   1/1/2017   paris           45         20   Sunny
9   1/2/2017   paris           50         13  Cloudy
10  1/3/2017   paris           54          8  Cloudy
11  1/4/2017   paris           42         10  Cloudy

In [65]:
#slicing
df[1:4]

        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [67]:
df.columns

Index(['day', 'city', 'temperature', 'windspeed', 'event'], dtype='object')

In [69]:
#accessing the single column
df['day']

0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/4/2017
4     1/1/2017
5     1/2/2017
6     1/3/2017
7     1/4/2017
8     1/1/2017
9     1/2/2017
10    1/3/2017
11    1/4/2017
Name: day, dtype: object

In [70]:
#get two or more columns
df[['day','city']]

         day      city
0   1/1/2017  new york
1   1/2/2017  new york
2   1/3/2017  new york
3   1/4/2017  new york
4   1/1/2017    mumbai
5   1/2/2017    mumbai
6   1/3/2017    mumbai
7   1/4/2017    mumbai
8   1/1/2017     paris
9   1/2/2017     paris
10  1/3/2017     paris
11  1/4/2017     paris

In [71]:
#print maximum temperature
df['temperature'].max()

92

In [72]:
#print minimum temperature
df['temperature'].min()

28

In [73]:
df['temperature'].describe()

count    12.000000
mean     56.166667
std      25.044808
min      28.000000
25%      35.250000
50%      47.500000
75%      85.500000
max      92.000000
Name: temperature, dtype: float64

In [78]:
#retrieving row which has maximum tem
df[df['temperature']==df['temperature'].max()]

        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  Rain

In [12]:
r = df.groupby('city')
r

In [14]:
#to retrieve informaion about specific group
r.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [23]:
#Retrieve maximum temperature and windspeed in each cities
r.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [24]:
r.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [25]:
r.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

### Concatenate the DataFrame

In [34]:
india_weather = pd.DataFrame({'city':['bangalore','chennai','salem'],
                  'Temperature':[36.3,43.5,40.2],
                  'Humidity':[70,80,75]})

In [36]:
india_weather

        city  Temperature  Humidity
0  bangalore         36.3        70
1    chennai         43.5        80
2      salem         40.2        75

In [37]:
us_weather = pd.DataFrame({'city':['new york','chicago','orlanda'],
                          'Temperature':[20,18,23],
                          'Humidity':[64,60,62]})

In [38]:
us_weather

       city  Temperature  Humidity
0  new york           20        64
1   chicago           18        60
2   orlanda           23        62

In [43]:
df = pd.concat([india_weather,us_weather],ignore_index=True)

In [44]:
df

        city  Temperature  Humidity
0  bangalore         36.3        70
1    chennai         43.5        80
2      salem         40.2        75
3   new york         20.0        64
4    chicago         18.0        60
5    orlanda         23.0        62

In [46]:
df1 = pd.concat([india_weather,us_weather],axis=1)
df1

        city  Temperature  Humidity      city  Temperature  Humidity
0  bangalore         36.3        70  new york           20        64
1    chennai         43.5        80   chicago           18        60
2      salem         40.2        75   orlanda           23        62

### Merge DataFrame

In [50]:
temperature_df = pd.DataFrame({'city':['bangalore','chennai','coimbatore','salem'],
                             'temperature':[30,40,35,40]})

In [51]:
humidity_df = pd.DataFrame({'city':['bangalore','chennai','coimbatore'],
                           'humidity':[78,80,60]})

In [56]:
##merge two dataframe without explicity mentioning the index
df = pd.merge(temperature_df,humidity_df,on='city')
df

         city  temperature  humidity
0   bangalore           30        78
1     chennai           40        80
2  coimbatore           35        60

In [58]:
##merge two dataframe using outer join
df = pd.merge(temperature_df,humidity_df,on = 'city',how='outer')
df

         city  temperature  humidity
0   bangalore           30      78.0
1     chennai           40      80.0
2  coimbatore           35      60.0
3       salem           40       NaN